Repository: KirillSklyarov/EfMobileTDL
Catalog: EfMobileTDL/Resources/*.lproj/Localizable.strings
Languages: ru

# mainTitle
source: Tasks
ru: Задачи

# backButton
source: Back
ru: Назад

# loadingError
source: Loading data error
ru: Ошибка загрузки данных

source: tasks
ru: задач

source: Edit
ru: Редактировать

source: Share
ru: Поделиться

source: Delete
ru: Удалить

# addTask
source: Add New Task
ru: Добавить задачу

# addTask subtitle
source: Enter task description
ru: Введите описание задачи

source: Edit task
ru: Редактировать задачу

# dataNotChanged
source: ℹ️ Data hasn't changed, update not required
ru: ℹ️ Данные не изменились, обновление не требуется

# taskRemoved
source: ✅ Task removed successfully
ru: ✅ Запись успешно удалена

# contextOK
source: ✅ Context saved successfully
ru: ✅ Контекст успешно сохранен

# coreDataEmpty
source: 📭 Core Data is empty - no data
ru: 📭 Core Data пуста - нет данных

# errorFindingObject
source: ❌ Error finding object by ID: %@
ru: ❌ Ошибка при поиске объекта по ID: %@

# coreDataLoaded
source: ✅ CoreData upload successfully
ru: ✅ CoreData загружена успешно

# coreDataError
source: ❌ Error fetching data: %@
ru: ❌ Ошибка при получении данных: %@

# taskUpdated
source: ✅ Task updated successfully
ru: ✅ Запись успешно обновлена

# newTaskAdded
source: ✅ New task added successfully
ru: ✅ Новая запись успешно добавлена

# dataFromServer
source: 🌐 Data fetched from server
ru: 🌐 Данные получены от сервера

# dataFromCoreData
source: 📦 Data fetched from CoreData
ru: 📦 Данные получены от CoreData

# coreDataContainerError
source: 🔴 Unresolved error %@, %@
ru: 🔴 Ошибка загрузки контейнера %@, %@

# coreDataRecordsCount
source: 📋 Data from Core Data (%d records)
ru: 📋 Данные из Core Data (%d записей)

# shareTask
source: Title: %@ Description: %@
ru: Задача: %@ Описание: %@

source: Enter task title
ru: Введите тему задачи

# enterTaskSubtitle
source: Enter task description
ru: Введите описание задачи

source: Save
ru: Сохранить

source: Search
ru: Поиск
